{
  "users": [
    {
      "email": "igor@gmail.com",
      "password": "$2a$10$EqLBW19hB.rz7awNfptEmea57uWn7lF6fRB69W/X5iEE6d1ACsItC",
      "name": "igor",
      "age": "07/01/2002",
      "id": 1
    }
  ],
  "animes": [
    {
      "name": "Kimetsu no Yaiba",
      "seasons": 1,
      "episodes": 26,
      "synopsis": "Desde a morte de seu pai, o fardo de sustentar a família recai sobre os ombros de Tanjirou Kamado. Apesar de viver na pobreza em uma montanha remota, a família Kamado pode desfrutar de uma vida relativamente tranquila e feliz. Um dia, Tanjirou decide descer à aldeia local para ganhar algum dinheiro vendendo carvão. Na volta, anoitece, obrigando Tanjirou a se abrigar na casa de um homem estranho, que o avisa da existência de demônios carnívoros que se escondem na floresta à noite. Quando ele finalmente chega em casa no dia seguinte, ele se depara com uma visão horrível - sua família inteira foi massacrada. Pior ainda, o único sobrevivente é sua irmã Nezuko, que foi transformada em um demônio sanguinário. Consumido pela raiva e ódio, Tanjirou jura vingar sua família e ficar com seu único irmão restante. Ao lado do misterioso grupo que se autodenomina Demon Slayer Corps, Tanjirou fará o que for preciso para matar os demônios e proteger os restos da humanidade de sua amada irmã.",
      "image_url": "https://cdn.myanimelist.net/images/anime/1286/99889.jpg",
      "small_image_url": "https://cdn.myanimelist.net/images/anime/1286/99889t.jpg",
      "genres": "Ação, Sobrenatural",
      "id": 1
    },
    {
      "name": "Fullmetal Alchemist",
      "seasons": 1,
      "episodes": 51,
      "synopsis": "Edward Elric, um jovem alquimista brilhante, perdeu muito em sua vida de 12 anos: quando ele e seu irmão Alphonse tentam ressuscitar sua mãe morta por meio do ato proibido de transmutação humana, Edward perde seu irmão e também dois de seus membros. Com suas habilidades supremas de alquimia, Edward liga a alma de Alphonse a uma grande armadura. Um ano depois, Edward, agora promovido a alquimista de metal completo do estado, embarca em uma jornada com seu irmão mais novo para obter a Pedra Filosofal. Há rumores de que o objeto mítico lendário é capaz de amplificar as habilidades de um alquimista aos trancos e barrancos, permitindo que eles superem a lei fundamental da alquimia: para ganhar algo, um alquimista deve sacrificar algo de igual valor. Edward espera recorrer aos recursos militares para encontrar a lendária pedra e restaurar o corpo dele e de Alphonse ao normal. No entanto, os irmãos Elric logo descobrem que há mais na lendária pedra do que os olhos podem ver, enquanto são levados ao epicentro de uma batalha muito mais sombria do que eles poderiam ter imaginado.",
      "image_url": "https://cdn.myanimelist.net/images/anime/10/75815.jpg",
      "small_image_url": "https://cdn.myanimelist.net/images/anime/10/75815t.jpg",
      "genres": "Ação, Aventura, Comédia, Drama, Fantasia",
      "id": 2
    },
    {
      "name": "Jujutso Kaisen",
      "seasons": 1,
      "episodes": 24,
      "synopsis": "Sofrimento, arrependimento, vergonha: os sentimentos negativos dos humanos tornam-se Maldições, causando terríveis acidentes que podem levar até mesmo à morte. E pra piorar, Maldições só podem ser exorcizadas por outras Maldições. Certo dia, para salvar amigos que estavam sendo atacados por Maldições, Yuji Itadori engole o dedo do Ryomen-Sukuna, absorvendo sua Maldição. Ele então decide se matricular no Colégio Técnico de Feitiçaria de Tóquio, uma organização que combate as Maldições... e assim começa a heróica lenda do garoto que tornou-se uma Maldição para exorcizar uma Maldição.",
      "image_url": "https://cdn.myanimelist.net/images/anime/1171/109222.jpg",
      "small_image_url": "https://cdn.myanimelist.net/images/anime/1171/109222t.jpg",
      "genres": "Exorcismo, terror",
      "id": 3
    },
    {
      "name": "Spy x Family",
      "seasons": 1,
      "episodes": 9,
      "synopsis": "A história acompanha um dos maiores espiões do mundo tendo que se infiltrar no país inimigo para eliminar uma figura importante do governo. Como forma de aproximação do seu alvo, ele precisa encontrar uma família, e por conta disso acaba adotando uma garota, e formando um acordo para se casar com uma mulher local. Entretanto, o que ele não imagina, é que a garota na verdade é uma esper (Um indivíduo capaz de realizar telepatia e outras habilidades paranormais.), e sua nova esposa é uma assassina de aluguel. Assim, os três começam a morar juntos, tendo que esconder suas verdadeiras identidades uns dos outros.",
      "image_url": "https://cdn.myanimelist.net/images/anime/1441/122795.jpg",
      "small_image_url": "https://cdn.myanimelist.net/images/anime/1441/122795t.jpg",
      "genres": "Ação, Comédia, Romance",
      "id": 4
    },
    {
      "name": "Sword Art Online",
      "seasons": 4,
      "episodes": 97,
      "synopsis": "No ano de 2022, a realidade virtual progrediu aos trancos e barrancos, e um enorme jogo de RPG online chamado Sword Art Online (SAO) foi lançado. Com a ajuda da tecnologia 'NerveGear', os jogadores podem controlar seus avatares dentro do jogo usando apenas seus próprios pensamentos. Kazuto Kirigaya, apelidado de 'Kirito', está entre os poucos entusiastas sortudos que colocam as mãos na primeira remessa do jogo. Ele se conecta para se encontrar, com dez mil outras pessoas, no mundo cênico e elaborado de Aincrad, um mundo cheio de fantásticas armas medievais e monstros horríveis. No entanto, em uma virada cruel de eventos, os jogadores logo percebem que não podem sair; o criador do jogo os prendeu em seu novo mundo até que completem todos os cem níveis do jogo. Para escapar de Aincrad, Kirito agora terá que interagir e cooperar com seus colegas jogadores. Alguns são aliados, enquanto outros são inimigos, como Asuna Yuuki, que comanda o grupo líder que tenta escapar do jogo implacável. Para piorar as coisas, Sword Art Online não é só diversão e jogos: se eles morrem em Aincrad, eles morrem na vida real. Kirito deve se adaptar a sua nova realidade, lutar por sua sobrevivência e, com sorte, se libertar de seu inferno virtual.",
      "image_url": "https://cdn.myanimelist.net/images/anime/11/39717.jpg",
      "small_image_url": "https://cdn.myanimelist.net/images/anime/11/39717t.jpg",
      "genres": "Aventura, Ficção Científica",
      "id": 5
    },
    {
      "name": "Akame ga kill",
      "seasons": 1,
      "episodes": 24,
      "synopsis": "Night Raid é o braço secreto do Exército Revolucionário para assassinar, um levante montado para derrubar o primeiro-ministro Honesto, cuja avareza e ganância pelo poder o levaram a tirar vantagem da inexperiência do filho imperador. Sem um líder forte e benevolente, o resto da nação se afoga na pobreza, conflito e ruína. Embora os membros do Night Raid sejam todos assassinos experientes, eles entendem que tirar vidas está longe de ser louvável e que provavelmente enfrentarão retaliação ao eliminar impiedosamente qualquer um que esteja no caminho da revolução. O mais novo membro deste alegre bando de assassinos é Tatsumi, um menino ingênuo de uma vila remota que embarcou em uma jornada para ajudar sua empobrecida cidade natal e foi conquistado não apenas pelos ideais do Night Raid, mas também por sua determinação. Akame ga Kill! segue Tatsumi enquanto ele luta contra o Império e fica cara a cara com armas poderosas, assassinos inimigos, desafios à sua própria moral e valores e, em última análise, o que realmente significa ser um assassino com uma causa.",
      "image_url": "https://cdn.myanimelist.net/images/anime/1429/95946.jpg",
      "small_image_url": "https://cdn.myanimelist.net/images/anime/1429/95946t.jpg",
      "genres": "Aventura, Ação",
      "id": 6
    },
    {
      "name": "Black Clover",
      "seasons": 4,
      "episodes": 170,
      "synopsis": "Asta e Yuno foram abandonados na mesma igreja no mesmo dia. Criados juntos quando crianças, eles conheceram o 'Rei Mago' - um título dado ao mago mais forte do reino - e prometeram que iriam competir entre si pela posição do próximo Rei Mago. No entanto, à medida que cresceram, a grande diferença entre eles tornou-se evidente. Enquanto Yuno é capaz de manejar magia com incrível poder e controle, Asta não pode usar magia e tenta desesperadamente despertar seus poderes treinando fisicamente. Quando eles atingem a idade de 15 anos, Yuno é agraciado com um espetacular Grimoire com um trevo de quatro folhas, enquanto Asta não recebe nada. No entanto, logo depois, Yuno é atacado por uma pessoa chamada Lebuty, cujo objetivo principal é obter o Grimoire de Yuno. Asta tenta lutar contra Lebuty, mas ele é derrotado. Embora sem esperança e à beira da derrota, ele encontra forças para continuar quando ouve a voz de Yuno. Liberando suas emoções internas em fúria, Asta recebe um trevo de cinco folhas Grimoire, um 'Trevo Negro' que lhe dá poder suficiente para derrotar Lebuty. Poucos dias depois, os dois amigos partem para o mundo, ambos buscando o mesmo objetivo - se tornar o Rei Mago!",
      "image_url": "https://cdn.myanimelist.net/images/anime/2/88336.jpg",
      "small_image_url": "https://cdn.myanimelist.net/images/anime/2/88336t.jpg",
      "genres": "Ficção, Aventura",
      "id": 7
    },
    {
      "name": "Blue Exorcist",
      "seasons": 2,
      "episodes": 37,
      "synopsis": "Humanos e demônios são duas faces da mesma moeda, assim como Assiah e Gehenna, seus respectivos mundos. A única maneira de viajar entre os reinos é por meio da possessão, como nas histórias de fantasmas. No entanto, Satanás, o governante da Gehenna, não pode encontrar um hospedeiro adequado para possuir e, portanto, permanece aprisionado em seu mundo. Em uma tentativa desesperada de conquistar Assiah, ele envia seu filho, com a intenção de que ele eventualmente se transforme em um recipiente capaz de ser possuído pelo rei demônio. Ao no Exorcist segue Rin Okumura, que parece ser um adolescente comum, um tanto problemático - até que um dia ele é emboscado por demônios. Seu mundo vira de cabeça para baixo quando ele descobre que ele é na verdade o próprio filho de Satanás e que seu pai demônio deseja que ele volte para que possam conquistar Assiah juntos. Não querendo se juntar ao rei da Gehenna, Rin decide começar a treinar para se tornar um exorcista para que ele possa lutar para defender Assiah ao lado de seu irmão Yukio.",
      "image_url": "https://cdn.myanimelist.net/images/anime/10/75195.jpg",
      "small_image_url": "https://cdn.myanimelist.net/images/anime/10/75195t.jpg",
      "genres": "Terror, Drama, Ação, Fantasia Sombria",
      "id": 8
    },
    {
      "name": "Death Note",
      "seasons": 1,
      "episodes": 37,
      "synopsis": "Um estudante de repente encontra um caderno que caiu do céu. Trata-se do Death Note, que permite ao seu portador matar qualquer pessoa a partir da mera anotação do nome do alvo em uma de suas páginas. Sob a influência de Ruyk, dono do caderno, ele passa a usá-lo para eliminar criminosos e pessoas que escaparam da justiça. A súbita onda de assassinatos faz com que ele seja endeusado por muitos, que o apelidam de Kira, mas também atrai a atenção de um enigmático e brilhante detetive, chamado L.",
      "image_url": "https://cdn.myanimelist.net/images/anime/9/9453.jpg",
      "small_image_url": "https://cdn.myanimelist.net/images/anime/9/9453t.jpg",
      "genres": "Mistério, Suspense",
      "id": 9
    },
    {
      "name": "Dragon ball z",
      "seasons": 9,
      "episodes": 639,
      "synopsis": "Criada por Akira Toryiama, a franquia conta a história de Son Goku, um guerreiro que descobre ser parte de um legado de poderosos conquistadores alienígenas - e passa a defender seu planeta adotivo, a Terra, de outros seres igualmente superfortes e capazes de feitos descomunais.",
      "image_url": "https://cdn.myanimelist.net/images/anime/1607/117271.jpg",
      "small_image_url": "https://cdn.myanimelist.net/images/anime/1607/117271t.jpg",
      "genres": "Ação, Comédia, Aventura, Artes Marciais, Suspense ",
      "id": 10
    },
    {
      "name": "Fullmetal Alchemist Brotherhood",
      "seasons": 1,
      "episodes": 64,
      "synopsis": "Depois que um experimento de alquimia horrível dá errado na casa de Elric, os irmãos Edward e Alphonse são deixados em uma nova realidade catastrófica. Ignorando o princípio alquímico que proíbe a transmutação humana, os meninos tentaram trazer sua mãe recentemente falecida de volta à vida. Em vez disso, eles sofreram uma perda pessoal brutal: o corpo de Alphonse se desintegrou enquanto Edward perdeu uma perna e, em seguida, sacrificou um braço para manter a alma de Alphonse no reino físico, prendendo-o a uma enorme armadura. Os irmãos são resgatados por sua vizinha Pinako Rockbell e sua neta Winry. Conhecido como um prodígio da engenharia biomecânica, Winry cria membros protéticos para Edward utilizando 'automail', um metal resistente e versátil usado em robôs e armaduras de combate. Após anos de treinamento, os irmãos Elric partiram em uma missão para restaurar seus corpos localizando a Pedra Filosofal - uma joia poderosa que permite a um alquimista desafiar as leis tradicionais da Troca Equivalente. Enquanto Edward se torna um alquimista infame e ganha o apelido de 'Fullmetal', a jornada dos meninos os envolve em uma conspiração crescente que ameaça o destino do mundo.",
      "image_url": "https://cdn.myanimelist.net/images/anime/1223/96541.jpg",
      "small_image_url": "https://cdn.myanimelist.net/images/anime/1223/96541t.jpg",
      "genres": "Ação, Aventura, Comédia, Drama, Fantasia",
      "id": 11
    },
    {
      "name": "Naruto",
      "seasons": 9,
      "episodes": 211,
      "synopsis": "Naruto é um jovem órfão habitante da Vila da Folha que sonha se tornar o quinto Hokage, o maior guerreiro e governante da vila. Ao se graduar como ninja, descobre que tem um demônio raposa selado dentro de si.",
      "image_url": "https://cdn.myanimelist.net/images/anime/13/17405.jpg",
      "small_image_url": "https://cdn.myanimelist.net/images/anime/13/17405t.jpg",
      "genres": "Ação, Aventura, Comédia, Drama, Fantasia",
      "id": 12
    },
    {
      "name": "Naruto Shippuden",
      "seasons": 21,
      "episodes": 500,
      "synopsis": "Há muito tempo, um espírito poderoso levou o mundo à beira da destruição. Naruto é incumbido de proteger Shion, uma sacerdotisa da Terra dos Ogros que é perseguida por um espírito, e ajudá-la a salvar o mundo.",
      "image_url": "https://cdn.myanimelist.net/images/anime/5/17407.jpg",
      "small_image_url": "https://cdn.myanimelist.net/images/anime/5/17407t.jpg",
      "genres": "Ação, Aventura, Comédia, Drama, Fantasia",
      "id": 13
    },
    {
      "name": "Tokyo Revengers",
      "seasons": 1,
      "episodes": 24,
      "synopsis": "Tokyo Revengers gira em torno de Takemichi Hanagaki, um homem de 26 anos mal sucedido na vida em todos os âmbitos, desde o profissional à relações amorosas. Um certo dia, ao assistir um jornal na TV, Takemichi descobre que sua primeira namorada havia sido morta num incidente que envolvia gangues de Tokyo. Essa notícia mexeu bastante com o rapaz, que ficou pensativo sobre a perda de seu primeiro e único amor. Ao entrar numa estação de metrô, Takemichi é empurrado aos trilhos e quando estava prestes a ser atropelado algo surpreendente acontece: ele viaja 12 anos no passado, voltando para a época de escola quando ainda namorava Hina.",
      "image_url": "https://cdn.myanimelist.net/images/anime/1839/122012.jpg",
      "small_image_url": "https://cdn.myanimelist.net/images/anime/1839/122012t.jpg",
      "genres": "Ação, Drama",
      "id": 14
    },
    {
      "name": "Pokémon",
      "seasons": 19,
      "episodes": 932,
      "synopsis": "Cientistas criam o mais forte e poderoso Pokémon do planeta: Mewtwo, um Pokémon com poderes psíquicos. Só que a criatura se rebela, provocando uma batalha contra os maiores treinadores de Pokémon, a fim de conquistar o planeta.",
      "image_url": "https://cdn.myanimelist.net/images/anime/13/73834t.jpg",
      "small_image_url": "https://cdn.myanimelist.net/images/anime/13/73834.jpg",
      "genres": "Ação, Aventura, Fantasia",
      "id": 15
    },
    {
      "name": "Yu-Gi-Oh!",
      "seasons": 5,
      "episodes": 224,
      "synopsis": "O jovem estudante do ensino médio Yugi Muto derrota o campeão mundial, Seto Kaiba, em um duelo de cartas com a misteriosa ajuda do quebra-cabeça Millenium. Em razão de sua vitória inesperada, Yugi se torna famoso em todo o mundo e passa a participar de outros duelos para salvar os amigos e a família.",
      "image_url": "https://cdn.myanimelist.net/images/anime/3/77055.jpg",
      "small_image_url": "https://cdn.myanimelist.net/images/anime/3/77055t.jpg",
      "genres": "Ficção de aventura, Fantasia científica",
      "id": 16
    },
    {
      "name": "Card Captor Sakura",
      "seasons": 3,
      "episodes": 70,
      "synopsis": " Cardcaptor Sakura conta a história de Sakura Kinomoto, uma garota de 10 anos que liberta acidentalmente um conjunto de cartas mágicas chamadas Cartas Clow. Seu trabalho então, é reunir todas elas antes de essas causarem transtornos à cidade onde ela vive.",
      "image_url": "https://cdn.myanimelist.net/images/anime/1467/90338.jpg",
      "small_image_url": "https://cdn.myanimelist.net/images/anime/1467/90338t.jpg",
      "genres": "Romance, Mahō shōjo",
      "id": 17
    },
    {
      "name": "Bleach",
      "seasons": 16,
      "episodes": 366,
      "synopsis": "Ichigo Kurosaki nasceu com o dom de ver fantasmas. Quando sua família é atacada por uma alma malévola, Ichigo se torna um Shinigami, dedicando sua vida a proteger os inocentes e ajudando os espíritos torturados a encontrar a paz.",
      "image_url": "https://cdn.myanimelist.net/images/anime/3/40451t.jpg",
      "small_image_url": "https://cdn.myanimelist.net/images/anime/3/40451t.jpg",
      "genres": "Ficção de aventura, Ficção supernatural",
      "id": 18
    },
    {
      "name": "Fairy tail",
      "seasons": 3,
      "episodes": 328,
      "synopsis": "A história segue as aventuras de Lucy Heartfilia, uma jovem maga que sonha em se tornar escritora e Natsu Dragneel, um mago adolescente que é membro da popular guilda de feiticeiros Fairy Tail que está a procura do dragão Igneel.",
      "image_url": "https://cdn.myanimelist.net/images/anime/5/18179t.jpg",
      "small_image_url": "https://cdn.myanimelist.net/images/anime/5/18179t.jpg",
      "genres": "Ação, Aventura, Fantasia, Comédia dramática",
      "id": 19
    }
  ]
}